Revit 2023 API
TopographySurface.DeletePoints Method
 Deletes points from a Topography surface.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
public void DeletePoints(
	IList<XYZ> points
)
Visual Basic
Public Sub DeletePoints ( _
	points As IList(Of XYZ) _
)
Visual C++
public:
void DeletePoints(
	IList<XYZ^>^ points
)
Parameters
points
Type: System.Collections.Generic.IList<XYZ>
 A collection of points to be deleted.
Remarks
 Points will be deleted if they matched in XY. This function ignores input points that do not exist, unless all of the input points do not exist, which will result in an exception. This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad), which shoule be in an active TopographyEditScope.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  There are no points in the input points set.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This element is not a TopographySurface. -or- The topography surface is not editable. -or- The TopographySurface element is not in an active TopographyEditScope. Modification cannot be made on this TopographySurface. -or- The points of this topography surface are not editable. -or- None of the input points exists in the current TopographySurface.
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document containing this TopographySurface is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing this TopographySurface is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document containing this TopographySurface has no open transaction.
See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace